#+title: Bescherelle Org
#+author: cf [Linux 6.14.6-zen1-1-zen x86_64 GNU/Linux]
#+date: <2025-06-12 08:38>

+ References:
  - [[https://conjugaison.bescherelle.com][Bescherelle Conjugaison | Le conjugueur Bescherelle, la référence en conjugai...]]
  - [[https://www.digischool.fr/education/conjugaison/verbes][Liste de tous les verbes français et leur conjugaison - digiSchool]]
  - [[https://github.com/junegunn/fzf][GitHub - junegunn/fzf: :cherry_blossom: A command-line fuzzy finder]]
  - man:fzf
  - man:parallel

** Acquérir une liste de tous les verbes

Une méthode ou une autre, en autant que les verbes y sont. Quoiqu'il
en soit, à défault d'une méthode plus optimale (et après quelques
tentatives ridicules de Mr.GPT), j'ai opté pour un copié-collé de la
[[https://www.digischool.fr/education/conjugaison/verbes][Liste de tous les verbes français et leur conjugaison]]
dans un tampon Emacs sauvegardé sous le nom très recherché de =verbes=
Ensuite, une petite ligne de =sed= pour faire le ménage:
#+begin_src shell :results output
cat ./verbes | grep -ivE "Verbes en " | sed -e 's/ - /\n/g' -e 's/^ *- *//; s/ *- *$//; s/^ *//; s/ *$//' | sed "/^$/d" | sed 's/[àáâä]/a/gI; s/[ÀÁÂÄ]/A/gI;s/[èéêë]/e/gI;s/[ÈÉÊË]/E/gI;s/[ìíîï]/i/gI;s/[ÌÍÎÏ]/I/gI;s/[òóôö]/o/gI;s/[ÒÓÔÖ]/O/gI;s/[ùúûü]/u/gI;s/[ÙÚÛÜ]/U/gI;s/[ç]/c/gI;s/[Ç]/C/gI;s/[œ]/oe/gI;s/[Œ]/OE/gI;' | tee ./verbes-na | wc -l ; head ./verbes-na ; tail ./verbes-na ;
#+end_src

#+RESULTS:
#+begin_example
1976
abaisser
abandonner
abasourdir
abattre
abetir
abhorrer
abimer
abolir
abonder
abonner
voleter
vomir
voter
vouer
vouloir
vouter
vouvoyer
voyager
zapper
zezayer
#+end_example

#+Résultat: 1976 verbes non-accentués
#+begin_example
1976
abaisser
abandonner
abasourdir
abattre
abetir
abhorrer
abimer
abolir
abonder
abonner
voleter
vomir
voter
vouer
vouloir
vouter
vouvoyer
voyager
zapper
zezayer
#+end_example

cf. [[./verbes][verbes]], [[./verbes-na][verbes-na]]

** Générer les verbes

=GNU Parallel= optimise l'exécution des processus par parallélisation.
Il m'a semblé être le candidat idéal pour générer les 1976 verbes
précedemment acquis.

#+begin_src emacs-lisp
  (defvar org-babel-async-content nil)
  (use-package ob-async
    :ensure t
    :after org
    :config
    (require 'ob-async))
#+end_src

#+begin_src shell :async :results output
ulimit -n ; ulimit -Hn
#+end_src

#+RESULTS:
: 1024
: 524288

#+begin_src shell :async :results output
ulimit -n 262144
parallel -j0 --joblog ./conjuge.log conjuge -V {} -d ~/Templates/org-bescherelle/bescherelle -v :::: ~/Templates/org-bescherelle/verbes
#+end_src

#+begin_src shell :results output
head ~/Templates/org-bescherelle/conjuge.log ; tail ~/Templates/org-bescherelle/conjuge.log ;
#+end_src

#+RESULTS:
#+begin_example
Seq	Host	Starttime	JobRuntime	Send	Receive	Exitval	Signal	Command
332	:	1749468067.504	    20.052	0	0	0	0	conjuge -V celer -d /home/cf/Templates/org-bescherelle/bescherelle -v
335	:	1749468067.528	    20.054	0	0	0	0	conjuge -V cesser -d /home/cf/Templates/org-bescherelle/bescherelle -v
400	:	1749468068.109	    20.045	0	0	0	0	conjuge -V compenser -d /home/cf/Templates/org-bescherelle/bescherelle -v
402	:	1749468068.133	    20.047	0	0	0	0	conjuge -V complaire -d /home/cf/Templates/org-bescherelle/bescherelle -v
403	:	1749468068.146	    20.057	0	0	0	0	conjuge -V 'compléter' -d /home/cf/Templates/org-bescherelle/bescherelle -v
405	:	1749468068.166	    20.060	0	0	0	0	conjuge -V compliquer -d /home/cf/Templates/org-bescherelle/bescherelle -v
406	:	1749468068.176	    20.050	0	0	0	0	conjuge -V comporter -d /home/cf/Templates/org-bescherelle/bescherelle -v
407	:	1749468068.185	    20.042	0	0	0	0	conjuge -V composer -d /home/cf/Templates/org-bescherelle/bescherelle -v
408	:	1749468068.195	    20.057	0	0	0	0	conjuge -V comprendre -d /home/cf/Templates/org-bescherelle/bescherelle -v
1962	:	1749468094.325	   657.282	0	0	0	0	conjuge -V vivre -d /home/cf/Templates/org-bescherelle/bescherelle -v
612	:	1749468070.672	   746.473	0	0	0	0	conjuge -V 'déplacer' -d /home/cf/Templates/org-bescherelle/bescherelle -v
1126	:	1749468078.114	   800.470	0	0	0	0	conjuge -V 'interférer' -d /home/cf/Templates/org-bescherelle/bescherelle -v
78	:	1749468065.716	   816.967	0	0	0	0	conjuge -V affliger -d /home/cf/Templates/org-bescherelle/bescherelle -v
348	:	1749468067.638	   851.907	0	0	0	0	conjuge -V chercher -d /home/cf/Templates/org-bescherelle/bescherelle -v
604	:	1749468070.565	   848.980	0	0	0	0	conjuge -V 'départir' -d /home/cf/Templates/org-bescherelle/bescherelle -v
374	:	1749468067.862	   954.081	0	0	0	0	conjuge -V clouer -d /home/cf/Templates/org-bescherelle/bescherelle -v
1737	:	1749468089.029	  1014.835	0	0	0	0	conjuge -V saouler -d /home/cf/Templates/org-bescherelle/bescherelle -v
409	:	1749468068.205	  1097.098	0	0	0	0	conjuge -V compromettre -d /home/cf/Templates/org-bescherelle/bescherelle -v
1667	:	1749468087.556	  1106.420	0	0	0	0	conjuge -V ressaisir -d /home/cf/Templates/org-bescherelle/bescherelle -v
#+end_example
